In [1]:
import pandas as pd
import numpy as np

In [29]:
np.arange(0,20).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [45]:
#dataframe
df=pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=["row1",'row2','row3','row4','row5'],
            columns=['column1','column2','column3','column4'])

In [12]:
df.head()

      column1  column2  column3  column4  column5
row1        0        1        2        3        4
row2        5        6        7        8        9
row3       10       11       12       13       14
row4       15       16       17       18       19

In [13]:
df.tail()

      column1  column2  column3  column4  column5
row1        0        1        2        3        4
row2        5        6        7        8        9
row3       10       11       12       13       14
row4       15       16       17       18       19

In [15]:
df.describe()

         column1    column2    column3    column4    column5
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, row1 to row4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  4 non-null      int64
 1   column2  4 non-null      int64
 2   column3  4 non-null      int64
 3   column4  4 non-null      int64
 4   column5  4 non-null      int64
dtypes: int64(5)
memory usage: 192.0+ bytes

In [18]:
#indexing 
#.iloc=indexing
# columnname
df[['column1','column2','column3']]

      column1  column2  column3
row1        0        1        2
row2        5        6        7
row3       10       11       12
row4       15       16       17

In [22]:
df['column1']

row1     0
row2     5
row3    10
row4    15
Name: column1, dtype: int64

In [23]:
type(df[['column1','column2','column3']])
#dataframe means taking multiple rows and columns

pandas.core.frame.DataFrame

In [24]:
type(df['column1'])
#series means either you take one/single row or a column

pandas.core.series.Series

In [26]:
df.loc['row1']

column1    0
column2    1
column3    2
column4    3
column5    4
Name: row1, dtype: int64

In [32]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [33]:
df.iloc[2:4,0:2]

      column1  column2
row3        8        9
row4       12       13

In [34]:
#converting dataframe into values
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [35]:
#basic operation
df=pd.DataFrame(data=[[1,np.nan,2],[1,3,4]],index=["row1",'row2'],
            columns=['column1','column2','column3'])

In [38]:
df.head()

      column1  column2  column3
row1        1      NaN        2
row2        1      3.0        4

In [41]:
df.isnull().sum()

column1    0
column2    1
column3    0
dtype: int64

In [42]:
df.isnull().sum()==0

column1     True
column2    False
column3     True
dtype: bool

In [43]:
df['column3'].value_counts()

column3
2    1
4    1
Name: count, dtype: int64

In [46]:
df>2

      column1  column2  column3  column4
row1    False    False    False     True
row2     True     True     True     True
row3     True     True     True     True
row4     True     True     True     True
row5     True     True     True     True